## Proceso inicial

### ðŸ”§ Importar librerÃ­as y herramientas

### ðŸ“© Leer csv

In [1]:
import numpy as np
import pandas as pd 

import pylab as plt
import seaborn as sns
import regex as re

%matplotlib inline

In [2]:
actors =pd.read_csv('w3-Database-Project-main/data/actor.csv')    #Primero vamos a ver quÃ© hay en los archivos. En los 6
                                                                    #DespuÃ©s de la forma, mirar si hay nulos

print(actors.shape)
actors.head()

(200, 4)

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [3]:
actors.info(memory_usage='deep')    #no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [4]:
categ=pd.read_csv('w3-Database-Project-main/data/category.csv')    

print(categ.shape)
categ.head()

(16, 3)

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [5]:
categ.info(memory_usage='deep')    #no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [6]:
films=pd.read_csv('w3-Database-Project-main/data/film.csv')    #Primero vamos a ver quÃ© hay en los archivos. En los 6

print(films.shape)
films.head()

(1000, 13)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [7]:
films.info(memory_usage='deep')    #no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [8]:
invent=pd.read_csv('w3-Database-Project-main/data/inventory.csv')    #Primero vamos a ver quÃ© hay en los archivos. En los 6

print(invent.shape)
invent.head()

(1000, 4)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [9]:
invent.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [10]:
lang=pd.read_csv('w3-Database-Project-main/data/language.csv')    #Primero vamos a ver quÃ© hay en los archivos. En los 6

print(lang.shape)
lang.head()

(6, 3)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [11]:
lang.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [12]:
old_HDD=pd.read_csv('w3-Database-Project-main/data/old_HDD.csv')    #Primero vamos a ver quÃ© hay en los archivos. En los 6

print(old_HDD.shape)
old_HDD.head()

(1000, 5)

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [13]:
old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [14]:
rental=pd.read_csv('w3-Database-Project-main/data/rental.csv')    #Primero vamos a ver quÃ© hay en los archivos. En los 6

print(rental.shape)
rental.head()

(1000, 7)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [15]:
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

### como las tablas estÃ¡n limpias las conectamos con MySQL

In [16]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/lucia/opt/anaconda3/lib/python3.9/site-packages (8.0.29)
Requirement already satisfied: protobuf>=3.0.0 in /Users/lucia/opt/anaconda3/lib/python3.9/site-packages (from mysql-connector-python) (4.21.1)

In [17]:
import mysql.connector as conn

### ðŸ§³ Crear la BD

In [18]:
crea_db=conn.connect(host='localhost', user='root', passwd='Verano20')    #No sirve

cursor=crea_db.cursor()

cursor.execute('drop database if exists productos;')

In [19]:
crea_db=conn.connect(host='localhost', user='root', passwd=password)    #No sirve

cursor=crea_db.cursor()
cursor.execute('create database Blockbuster;')

DatabaseError: 1007 (HY000): Can't create database 'Blockbuster'; database exists

In [20]:
cursor.execute('show databases;')

for x in cursor:
    print(x)

('Blockbuster',)
('DAFT_!',)
('information_schema',)
('lab_mysql',)
('mysql',)
('performance_schema',)
('publications',)
('sys',)

In [48]:
file = open('password.txt','r').readlines()

password = ''.join(file)

In [50]:
type(password)

str

In [51]:
# conecta a una base de datos

db=conn.connect(host='localhost', user='root', passwd= password, database='Blockbuster')

cursor=db.cursor()

### Crear las "perchas" (tablas) de la BD

In [ ]:
#las tablas se van a creat en una especie de dos bloques <film, inventory, old_HDD>
#Segundo bloque <rental, language, category, actor>

In [24]:
cursor.execute('drop table if exists film;')

In [26]:
t_film='''

    create table film (
            
            film_id int primary key,
            title varchar(100),
            description varchar(100),
            release_year date,
            language_id varchar(50),
            last_update date
        );
'''

cursor.execute(t_film)

In [29]:
cursor.execute('drop table if exists t_inventory;')

In [31]:

t_inventory='''

        create table t_inventory (
            
            film_id int primary key,
            inventory_id varchar(100),
            store_id varchar(1000),
            last_update date
        );
    '''
    
cursor.execute(t_inventory)

In [32]:

cursor.execute('drop table if exists t_rental;')
t_rental= '''

        create table t_rental (
            
            rental_id int primary key,
            rental_date date,
            inventory_id varchar(1000),
            last_update date,
            customer_id varchar(100),
            return_date date,
            staff_id varchar(20)
        );
'''
    
cursor.execute(t_rental)

In [33]:

cursor.execute('drop table if exists t_old_HDD;')
t_old_HDD='''

        create table t_old_HDD (
            
            title int primary key,
            release_year date,
            category_id varchar(5),
            first_name varchar(50),
            last_name varchar(100)
        );
'''

cursor.execute(t_old_HDD)

In [35]:

cursor.execute('drop table if exists t_language;')
t_language= '''

        create table t_language (
            
            language_id int primary key,
            name varchar(100),
            last_update date
        );
'''

cursor.execute(t_language)

In [36]:

cursor.execute('drop table if exists t_category;')
t_category='''

        create table t_category (
            
            category_id int primary key,
            last_update date,
            name varchar(100)
        );
'''

cursor.execute(t_category)

In [37]:
cursor.execute('drop table if exists t_actor;')
t_actor='''

        create table t_actor (
            
            actor_id int primary key,
            last_update date,
            first_name varchar(100),
            last_name varchar(100)
        );
'''
cursor.execute(t_actor)

### Subir datos a la base
Tener en cuenta la estructura de datos para hacerlo

In [ ]:
#t_film, t_inventory, t_rental, t_actor, t_category, t_language, t_old_HDD
#df.columns=['brand', 'color', 'size', 'price', 'url', 'ean']

In [55]:
nombre_tabla='t_film'
#/w3-Database-Project-main/data'/film.csv
df.columns= film_id, title, description, release_year, language_id, last_update

columnas=','.join(df.columns)

for i in range(len(df)):
    
    valores=tuple(df.iloc[i].values)
    
    insert_query=f'insert into {nombre_tabla} ({columnas}) values {valores};'
    
    cursor.execute(insert_query)
    
    
db.commit()

SyntaxError: f-string: expecting '}' (2573034545.py, line 10)